tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Src/py32f032_hal_lpuart.c
/**
  ******************************************************************************
  * @file    py32f032_hal_lpuart.c
  * @author  MCU Application Team
  * @brief   LPUART HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Universal Asynchronous Receiver Transmitter Peripheral (LPUART).
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State and Errors functions
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
  [..]
    The LPUART HAL driver can be used as follows:

    (#) Declare a LPUART_HandleTypeDef handle structure (eg. LPUART_HandleTypeDef hlpuart).
    (#) Initialize the LPUART low level resources by implementing the HAL_LPUART_MspInit() API:
        (##) Enable the LPUARTx interface clock.
        (##) LPUART pins configuration:
            (+++) Enable the clock for the LPUART GPIOs.
            (+++) Configure these LPUART pins (TX as alternate function pull-up, RX as alternate function Input).
        (##) NVIC configuration if you need to use interrupt process (HAL_LPUART_Transmit_IT()
             and HAL_LPUART_Receive_IT() APIs):
            (+++) Configure the LPUARTx interrupt priority.
            (+++) Enable the NVIC LPUART IRQ handle.

    (#) Program the Baud Rate, Word Length, Stop Bit, Parity, first bit(MSB/LSB) 
        and Mode(Receiver/Transmitter) in the hlpuart Init structure.

    (#) Initialize the LPUART registers by calling the HAL_LPUART_Init() API.

     [..]
       (@) The specific LPUART interrupts (Transmission complete interrupt,
            RXNE interrupt and Error Interrupts) will be managed using the macros
            __HAL_LPUART_ENABLE_IT() and __HAL_LPUART_DISABLE_IT() inside the transmit
            and receive process.

     [..]
       (@)  HAL_LPUART_Init() configure also the low level Hardware GPIO, CLOCK, 
            CORTEX...etc) by calling the customized HAL_LPUART_MspInit() API.

    ##### Callback registration #####
    ==================================

    [..]
    The compilation define USE_HAL_LPUART_REGISTER_CALLBACKS when set to 1
    allows the user to configure dynamically the driver callbacks.

    [..]
    Use Function @ref HAL_LPUART_RegisterCallback() to register a user callback.
    Function @ref HAL_LPUART_RegisterCallback() allows to register following callbacks:
    (+) TxCpltCallback            : Tx Complete Callback.
    (+) RxCpltCallback            : Rx Complete Callback.
    (+) ErrorCallback             : Error Callback.
    (+) AbortCpltCallback         : Abort Complete Callback.
    (+) AbortTransmitCpltCallback : Abort Transmit Complete Callback.
    (+) AbortReceiveCpltCallback  : Abort Receive Complete Callback.
    (+) BreakFrameCallback        : Break Frame Detection Callback.
    (+) AddrMatchCallback         : Address Match Callback.
    (+) MspInitCallback           : LPUART MspInit.
    (+) MspDeInitCallback         : LPUART MspDeInit.
    This function takes as parameters the HAL peripheral handle, the Callback ID
    and a pointer to the user callback function.

    [..]
    Use function @ref HAL_LPUART_UnRegisterCallback() to reset a callback to the default
    weak (surcharged) function.
    @ref HAL_LPUART_UnRegisterCallback() takes as parameters the HAL peripheral handle,
    and the Callback ID.
    This function allows to reset following callbacks:
    (+) TxCpltCallback            : Tx Complete Callback.
    (+) RxCpltCallback            : Rx Complete Callback.
    (+) ErrorCallback             : Error Callback.
    (+) AbortCpltCallback         : Abort Complete Callback.
    (+) AbortTransmitCpltCallback : Abort Transmit Complete Callback.
    (+) AbortReceiveCpltCallback  : Abort Receive Complete Callback.
    (+) BreakFrameCallback        : Break Frame Detection Callback.
    (+) AddrMatchCallback         : Address Match Callback.
    (+) MspInitCallback           : LPUART MspInit.
    (+) MspDeInitCallback         : LPUART MspDeInit.

    [..]
    By default, after the @ref HAL_LPUART_Init() and when the state is HAL_LPUART_STATE_RESET
    all callbacks are set to the corresponding weak (surcharged) functions:
    examples @ref HAL_LPUART_TxCpltCallback(), @ref HAL_LPUART_RxCpltCallback().
    Exception done for MspInit and MspDeInit functions that are respectively
    reset to the legacy weak (surcharged) functions in the @ref HAL_LPUART_Init()
    and @ref HAL_LPUART_DeInit() only when these callbacks are null (not registered beforehand).
    If not, MspInit or MspDeInit are not null, the @ref HAL_LPUART_Init() and @ref HAL_LPUART_DeInit()
    keep and use the user MspInit/MspDeInit callbacks (registered beforehand).

    [..]
    Callbacks can be registered/unregistered in HAL_LPUART_STATE_READY state only.
    Exception done MspInit/MspDeInit that can be registered/unregistered
    in HAL_LPUART_STATE_READY or HAL_LPUART_STATE_RESET state, thus registered (user)
    MspInit/DeInit callbacks can be used during the Init/DeInit.
    In that case first register the MspInit/MspDeInit user callbacks
    using @ref HAL_LPUART_RegisterCallback() before calling @ref HAL_LPUART_DeInit()
    or @ref HAL_LPUART_Init() function.

    [..]
    When The compilation define USE_HAL_LPUART_REGISTER_CALLBACKS is set to 0 or
    not defined, the callback registration feature is not available
    and weak (surcharged) callbacks are used.

     [..]
        Two operation modes are available within this driver :

     *** Polling mode IO operation ***
     =================================
     [..]
       (+) Send an amount of data in blocking mode using HAL_LPUART_Transmit()
       (+) Receive an amount of data in blocking mode using HAL_LPUART_Receive()

     *** Interrupt mode IO operation ***
     ===================================
     [..]
       (+) Send an amount of data in non blocking mode using HAL_LPUART_Transmit_IT()
       (+) At transmission end of transfer HAL_LPUART_TxCpltCallback is executed and user can
            add his own code by customization of function pointer HAL_LPUART_TxCpltCallback
       (+) Receive an amount of data in non blocking mode using HAL_LPUART_Receive_IT()
       (+) At reception end of transfer HAL_LPUART_RxCpltCallback is executed and user can
            add his own code by customization of function pointer HAL_LPUART_RxCpltCallback
       (+) In case of transfer Error, HAL_LPUART_ErrorCallback() function is executed and user can
            add his own code by customization of function pointer HAL_LPUART_ErrorCallback

