tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Src/py32f032_hal_lpuart.c
      case HAL_LPUART_WAKEUP_CB_ID :
        hlpuart->WakeupCallback = pCallback;
        break;

      case HAL_LPUART_MSPINIT_CB_ID :
        hlpuart->MspInitCallback = pCallback;
        break;

      case HAL_LPUART_MSPDEINIT_CB_ID :
        hlpuart->MspDeInitCallback = pCallback;
        break;

      default :
        hlpuart->ErrorCode |= HAL_LPUART_ERROR_INVALID_CALLBACK;

        status =  HAL_ERROR;
        break;
    }
  }
  else if (hlpuart->gState == HAL_LPUART_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_LPUART_MSPINIT_CB_ID :
        hlpuart->MspInitCallback = pCallback;
        break;

      case HAL_LPUART_MSPDEINIT_CB_ID :
        hlpuart->MspDeInitCallback = pCallback;
        break;

      default :
        hlpuart->ErrorCode |= HAL_LPUART_ERROR_INVALID_CALLBACK;

        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    hlpuart->ErrorCode |= HAL_LPUART_ERROR_INVALID_CALLBACK;

    status =  HAL_ERROR;
  }

  __HAL_UNLOCK(hlpuart);

  return status;
}

/**
  * @brief  Unregister an LPUART Callback
  *         LPUART callaback is redirected to the weak predefined callback
  * @param  hlpuart LPUART handle
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_LPUART_TX_BLOCKCOMPLETE_CB_ID Tx Block Complete Callback ID
  *           @arg @ref HAL_LPUART_TX_HALFBLOCKCOMPLETE_CB_ID Tx Half Block Complete Callback ID
  *           @arg @ref HAL_LPUART_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *           @arg @ref HAL_LPUART_RX_BLOCKCOMPLETE_CB_ID Rx Block Complete Callback ID
  *           @arg @ref HAL_LPUART_RX_HALFBLOCKCOMPLETE_CB_ID Rx Half Block Complete Callback ID
  *           @arg @ref HAL_LPUART_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref HAL_LPUART_ERROR_CB_ID Error Callback ID
  *           @arg @ref HAL_LPUART_ABORT_COMPLETE_CB_ID Abort Complete Callback ID
  *           @arg @ref HAL_LPUART_ABORT_TRANSMIT_COMPLETE_CB_ID Abort Transmit Complete Callback ID
  *           @arg @ref HAL_LPUART_ABORT_RECEIVE_COMPLETE_CB_ID Abort Receive Complete Callback ID
  *           @arg @ref HAL_LPUART_WAKEUP_CB_ID Wakeup Callback ID
  *           @arg @ref HAL_LPUART_MSPINIT_CB_ID MspInit Callback ID
  *           @arg @ref HAL_LPUART_MSPDEINIT_CB_ID MspDeInit Callback ID
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_UnRegisterCallback(LPUART_HandleTypeDef *hlpuart, HAL_LPUART_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  __HAL_LOCK(hlpuart);

  if (HAL_LPUART_STATE_READY == hlpuart->gState)
  {
    switch (CallbackID)
    {
      case HAL_LPUART_TX_BLOCKCOMPLETE_CB_ID :
        hlpuart->TxBlockCpltCallback = HAL_LPUART_TxBlockCpltCallback;             /* Legacy weak TxBlockCpltCallback     */
        break;

      case HAL_LPUART_TX_HALFBLOCKCOMPLETE_CB_ID :
        hlpuart->TxHalfBlockCpltCallback = HAL_LPUART_TxHalfBlockCpltCallback;     /* Legacy weak TxHalfBlockCpltCallback */
        break;

      case HAL_LPUART_TX_COMPLETE_CB_ID :
        hlpuart->TxCpltCallback = HAL_LPUART_TxCpltCallback;                       /* Legacy weak TxCpltCallback          */
        break;

      case HAL_LPUART_RX_BLOCKCOMPLETE_CB_ID :
        hlpuart->RxBlockCpltCallback = HAL_LPUART_RxBlockCpltCallback;             /* Legacy weak RxBlockCpltCallback     */
        break;

      case HAL_LPUART_RX_HALFBLOCKCOMPLETE_CB_ID :
        hlpuart->RxHalfBlockCpltCallback = HAL_LPUART_RxHalfBlockCpltCallback;     /* Legacy weak RxHalfBlockCpltCallback */
        break;



      case HAL_LPUART_RX_COMPLETE_CB_ID :
        hlpuart->RxCpltCallback = HAL_LPUART_RxCpltCallback;                       /* Legacy weak RxCpltCallback          */
        break;

      case HAL_LPUART_ERROR_CB_ID :
        hlpuart->ErrorCallback = HAL_LPUART_ErrorCallback;                         /* Legacy weak ErrorCallback           */
        break;

      case HAL_LPUART_ABORT_COMPLETE_CB_ID :
        hlpuart->AbortCpltCallback = HAL_LPUART_AbortCpltCallback;                 /* Legacy weak AbortCpltCallback       */
        break;

      case HAL_LPUART_ABORT_TRANSMIT_COMPLETE_CB_ID :
        hlpuart->AbortTransmitCpltCallback = HAL_LPUART_AbortTransmitCpltCallback; /* Legacy weak
                                                                                  AbortTransmitCpltCallback               */
        break;

      case HAL_LPUART_ABORT_RECEIVE_COMPLETE_CB_ID :
        hlpuart->AbortReceiveCpltCallback = HAL_LPUART_AbortReceiveCpltCallback;   /* Legacy weak
                                                                                  AbortReceiveCpltCallback                */
        break;

      case HAL_LPUART_WAKEUP_CB_ID :
        hlpuart->WakeupCallback = HAL_LPUARTEx_WakeupCallback;                     /* Legacy weak WakeupCallback          */
        break;

      case HAL_LPUART_MSPINIT_CB_ID :
        hlpuart->MspInitCallback = HAL_LPUART_MspInit;                             /* Legacy weak MspInitCallback         */
        break;

      case HAL_LPUART_MSPDEINIT_CB_ID :
        hlpuart->MspDeInitCallback = HAL_LPUART_MspDeInit;                         /* Legacy weak MspDeInitCallback       */
        break;

      default :
        hlpuart->ErrorCode |= HAL_LPUART_ERROR_INVALID_CALLBACK;

        status =  HAL_ERROR;
        break;
    }
  }
  else if (HAL_LPUART_STATE_RESET == hlpuart->gState)
  {
    switch (CallbackID)
    {
      case HAL_LPUART_MSPINIT_CB_ID :
        hlpuart->MspInitCallback = HAL_LPUART_MspInit;
        break;

      case HAL_LPUART_MSPDEINIT_CB_ID :
        hlpuart->MspDeInitCallback = HAL_LPUART_MspDeInit;
        break;

      default :
        hlpuart->ErrorCode |= HAL_LPUART_ERROR_INVALID_CALLBACK;

        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    hlpuart->ErrorCode |= HAL_LPUART_ERROR_INVALID_CALLBACK;

