tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Src/py32f032_hal_lpuart.c
      /* Abort DMA RX */
      if (HAL_DMA_Abort_IT(hlpuart->hdmarx) != HAL_OK)
      {
        /* Call Directly hlpuart->hdmarx->XferAbortCallback function in case of error */
        hlpuart->hdmarx->XferAbortCallback(hlpuart->hdmarx);
      }
    }
    else
    {
      /* Reset Rx transfer counter */
      hlpuart->RxXferCount = 0U;

      /* Clear RxISR function pointer */
      hlpuart->pRxBuffPtr = NULL;

      /* Clear the Error flags in the ICR register */
      __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF | LPUART_CLEAR_NEF | LPUART_CLEAR_PEF | LPUART_CLEAR_FEF);

      /* Restore hlpuart->RxState to Ready */
      hlpuart->RxState = HAL_LPUART_STATE_READY;

      /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
      /* Call registered Abort Receive Complete Callback */
      hlpuart->AbortReceiveCpltCallback(hlpuart);
#else
      /* Call legacy weak Abort Receive Complete Callback */
      HAL_LPUART_AbortReceiveCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
    }
  }
  else
  {
    /* Reset Rx transfer counter */
    hlpuart->RxXferCount = 0U;

    /* Clear RxISR function pointer */
    hlpuart->pRxBuffPtr = NULL;

    /* Clear the Error flags in the ICR register */
    __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF | LPUART_CLEAR_NEF | LPUART_CLEAR_PEF | LPUART_CLEAR_FEF);

    /* Restore hlpuart->RxState to Ready */
    hlpuart->RxState = HAL_LPUART_STATE_READY;

    /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
    /* Call registered Abort Receive Complete Callback */
    hlpuart->AbortReceiveCpltCallback(hlpuart);
#else
    /* Call legacy weak Abort Receive Complete Callback */
    HAL_LPUART_AbortReceiveCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}

/**
  * @brief Handle LPUART interrupt request.
  * @param hlpuart LPUART handle.
  * @retval None
  */
void HAL_LPUART_IRQHandler(LPUART_HandleTypeDef *hlpuart)
{
  uint32_t isrflags   = READ_REG(hlpuart->Instance->ISR);
  uint32_t cr1its     = READ_REG(hlpuart->Instance->CR1);
  uint32_t cr3its     = READ_REG(hlpuart->Instance->CR3);

  uint32_t errorflags;
  uint32_t errorcode;

  /* If no error occurs */
  errorflags = (isrflags & (uint32_t)(LPUART_ISR_PE | LPUART_ISR_FE | LPUART_ISR_ORE | LPUART_ISR_NE));
  if (errorflags == 0U)
  {
    /* LPUART in mode Receiver ---------------------------------------------------*/
    if (((isrflags & LPUART_ISR_RXNE) != 0U) && (((cr1its & LPUART_CR1_RXNEIE) != 0U)))
    {
      if (hlpuart->RxISR != NULL)
      {
        hlpuart->RxISR(hlpuart);
      }
      return;
    }
  }

  /* If some errors occur */
  if ((errorflags != 0U)
      && ((((cr3its & (LPUART_CR3_EIE)) != 0U) || ((cr1its & (LPUART_CR1_RXNEIE | LPUART_CR1_PEIE)) != 0U))))
  {
    /* LPUART parity error interrupt occurred -------------------------------------*/
    if (((isrflags & LPUART_ISR_PE) != 0U) && ((cr1its & LPUART_CR1_PEIE) != 0U))
    {
      __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_PEF);

      hlpuart->ErrorCode |= HAL_LPUART_ERROR_PE;
    }

    /* LPUART frame error interrupt occurred --------------------------------------*/
    if (((isrflags & LPUART_ISR_FE) != 0U) && ((cr3its & LPUART_CR3_EIE) != 0U))
    {
      __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_FEF);

      hlpuart->ErrorCode |= HAL_LPUART_ERROR_FE;
    }

    /* LPUART noise error interrupt occurred --------------------------------------*/
    if (((isrflags & LPUART_ISR_NE) != 0U) && ((cr3its & LPUART_CR3_EIE) != 0U))
    {
      __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_NEF);

      hlpuart->ErrorCode |= HAL_LPUART_ERROR_NE;
    }

    /* LPUART Over-Run interrupt occurred -----------------------------------------*/
    if (((isrflags & LPUART_ISR_ORE) != 0U)
        && (((cr1its & LPUART_CR1_RXNEIE) != 0U) ||
            ((cr3its & (LPUART_CR3_EIE)) != 0U)))
    {
      __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF);

      hlpuart->ErrorCode |= HAL_LPUART_ERROR_ORE;
    }

    /* Call LPUART Error Call back function if need be ----------------------------*/
    if (hlpuart->ErrorCode != HAL_LPUART_ERROR_NONE)
    {
      /* LPUART in mode Receiver --------------------------------------------------*/
      if (((isrflags & LPUART_ISR_RXNE) != 0U)
          && ((cr1its & LPUART_CR1_RXNEIE) != 0U))
      {
        if (hlpuart->RxISR != NULL)
        {
          hlpuart->RxISR(hlpuart);
        }
      }

      /* If Error is to be considered as blocking :
          - Receiver Timeout error in Reception
          - Overrun error in Reception
          - any error occurs in DMA mode reception
      */
      errorcode = hlpuart->ErrorCode;
      if ((HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAR)) ||
          ((errorcode & (HAL_LPUART_ERROR_RTO | HAL_LPUART_ERROR_ORE)) != 0U))
      {
        /* Blocking error : transfer is aborted
           Set the LPUART state ready to be able to start again the process,
           Disable Rx Interrupts, and disable Rx DMA request, if ongoing */
        LPUART_EndRxTransfer(hlpuart);

        /* Disable the LPUART DMA Rx request if enabled */
        if (HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAR))
        {
          CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAR);

          /* Abort the LPUART DMA Rx channel */
          if (hlpuart->hdmarx != NULL)
          {
            /* Set the LPUART DMA Abort callback :
               will lead to call HAL_LPUART_ErrorCallback() at end of DMA abort procedure */
            hlpuart->hdmarx->XferAbortCallback = LPUART_DMAAbortOnError;

            /* Abort DMA RX */
            if (HAL_DMA_Abort_IT(hlpuart->hdmarx) != HAL_OK)
            {
              /* Call Directly hlpuart->hdmarx->XferAbortCallback function in case of error */
              hlpuart->hdmarx->XferAbortCallback(hlpuart->hdmarx);
            }
          }
          else
          {
            /* Call user error callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
            /*Call registered error callback*/
            hlpuart->ErrorCallback(hlpuart);
#else
            /*Call legacy weak error callback*/
            HAL_LPUART_ErrorCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */

