tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Src/py32f032_hal_lpuart.c
  /* Initialize the LPUART State */
  hlpuart->gState = HAL_LPUART_STATE_READY;
  hlpuart->RxState = HAL_LPUART_STATE_READY;

  __HAL_UNLOCK(hlpuart);

  return HAL_OK;
}

/**
  * @brief  Handle LPUART Communication Timeout.  Public use
  * @param hlpuart     LPUART handle.
  * @param Flag      Specifies the LPUART flag to check
  * @param Status    Flag status (SET or RESET)
  * @param Tickstart Tick start value
  * @param Timeout   Timeout duration
  * @retval HAL status
  */
HAL_StatusTypeDef LPUART_WaitOnFlagUntilTimeout(LPUART_HandleTypeDef *hlpuart, uint32_t Flag, FlagStatus Status,
                                              uint32_t Tickstart, uint32_t Timeout)
{
  /* Wait until flag is set */
  while ((__HAL_LPUART_GET_FLAG(hlpuart, Flag) ? SET : RESET) == Status)
  {
    /* Check for the Timeout */
    if (Timeout != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - Tickstart) > Timeout) || (Timeout == 0U))
      {
        return HAL_TIMEOUT;
      }

      if ((READ_BIT(hlpuart->Instance->CR1, USART_CR1_RE) != 0U) && (Flag != UART_FLAG_TXE) && (Flag != LPUART_FLAG_TC))
      {
        if (__HAL_LPUART_GET_FLAG(hlpuart, LPUART_FLAG_ORE) == SET)
        {
          /* Clear Overrun Error flag*/
          __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF);

          /* Blocking error : transfer is aborted
          Set the UART state ready to be able to start again the process,
          Disable Rx Interrupts if ongoing */
          LPUART_EndRxTransfer(hlpuart);

          hlpuart->ErrorCode = HAL_UART_ERROR_ORE;

          /* Process Unlocked */
          __HAL_UNLOCK(hlpuart);

          return HAL_ERROR;
        }
      }
    }
  }
  return HAL_OK;
}


/**
  * @brief  End ongoing Tx transfer on LPUART peripheral (following error detection or Transmit completion).
  * @param  hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_EndTxTransfer(LPUART_HandleTypeDef *hlpuart)
{
  /* Disable TXEIE, TCIE, TXFT interrupts */
  CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_TXEIE | LPUART_CR1_TCIE));

  /* At end of Tx process, restore hlpuart->gState to Ready */
  hlpuart->gState = HAL_LPUART_STATE_READY;
}


/**
  * @brief  End ongoing Rx transfer on LPUART peripheral (following error detection or Reception completion).
  * @param  hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_EndRxTransfer(LPUART_HandleTypeDef *hlpuart)
{
  /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
  CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_RXNEIE | LPUART_CR1_PEIE));
  CLEAR_BIT(hlpuart->Instance->CR3, (LPUART_CR3_EIE ));

  /* At end of Rx process, restore hlpuart->RxState to Ready */
  hlpuart->RxState = HAL_LPUART_STATE_READY;

  /* Reset RxIsr function pointer */
  hlpuart->RxISR = NULL;
}


/**
  * @brief DMA LPUART transmit process complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMATransmitCplt(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

  /* DMA Normal mode */
  if (hdma->Init.Mode != DMA_INFINITE_CIRCULAR)
  {
    hlpuart->TxXferCount = 0U;

    /* Disable the DMA transfer for transmit request by resetting the DMAT bit
       in the LPUART CR3 register */
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAT);

    /* Enable the LPUART Transmit Complete Interrupt */
    SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_TCIE);
  }
  /* DMA Circular mode */
  else
  {
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
    /*Call registered Tx complete callback*/
    hlpuart->TxCpltCallback(hlpuart);
#else
    /*Call legacy weak Tx complete callback*/
    HAL_LPUART_TxCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
  }
}

/**
  * @brief DMA LPUART transmit process block complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMATxBlockCplt(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered Tx Block complete callback*/
  hlpuart->TxBlockCpltCallback(hlpuart);
#else
  /*Call legacy weak Tx Block complete callback*/
  HAL_LPUART_TxBlockCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA LPUART transmit process half block complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMATxHalfBlockCplt(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered Tx Half Block complete callback*/
  hlpuart->TxHalfBlockCpltCallback(hlpuart);
#else
  /*Call legacy weak Tx Half Block complete callback*/
  HAL_LPUART_TxHalfBlockCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA LPUART receive process complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMAReceiveCplt(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

  /* DMA Normal mode */
  if (hdma->Init.Mode != DMA_INFINITE_CIRCULAR)
  {
    hlpuart->RxXferCount = 0U;

    /* Disable PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(hlpuart->Instance->CR1, LPUART_CR1_PEIE);
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_EIE);

    /* Disable the DMA transfer for the receiver request by resetting the DMAR bit
       in the LPUART CR3 register */
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAR);

    /* At end of Rx process, restore hlpuart->RxState to Ready */
    hlpuart->RxState = HAL_LPUART_STATE_READY;
  }

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered Rx complete callback*/
  hlpuart->RxCpltCallback(hlpuart);
#else
  /*Call legacy weak Rx complete callback*/
  HAL_LPUART_RxCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA LPUART receive process block complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMARxBlockCplt(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered Rx Block complete callback*/
  hlpuart->RxBlockCpltCallback(hlpuart);
#else
  /*Call legacy weak Rx Block complete callback*/
  HAL_LPUART_RxBlockCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA LPUART receive process half block complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMARxHalfBlockCplt(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered Rx Half Block complete callback*/
  hlpuart->RxHalfBlockCpltCallback(hlpuart);
#else
  /*Call legacy weak Rx Half Block complete callback*/
  HAL_LPUART_RxHalfBlockCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA LPUART communication error callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMAError(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

  const HAL_LPUART_StateTypeDef gstate = hlpuart->gState;
  const HAL_LPUART_StateTypeDef rxstate = hlpuart->RxState;

  /* Stop LPUART DMA Tx request if ongoing */
  if ((HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAT)) &&
      (gstate == HAL_LPUART_STATE_BUSY_TX))
  {
    hlpuart->TxXferCount = 0U;
    LPUART_EndTxTransfer(hlpuart);
  }

  /* Stop LPUART DMA Rx request if ongoing */
  if ((HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAR)) &&
      (rxstate == HAL_LPUART_STATE_BUSY_RX))
  {
    hlpuart->RxXferCount = 0U;
    LPUART_EndRxTransfer(hlpuart);
  }

  hlpuart->ErrorCode |= HAL_LPUART_ERROR_DMA;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered error callback*/
  hlpuart->ErrorCallback(hlpuart);
#else
  /*Call legacy weak error callback*/
  HAL_LPUART_ErrorCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA LPUART communication abort callback, when initiated by HAL services on Error
  *         (To be called at end of DMA Abort procedure following error occurrence).
  * @param  hdma DMA handle.
  * @retval None
  */
static void LPUART_DMAAbortOnError(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);
  hlpuart->RxXferCount = 0U;
  hlpuart->TxXferCount = 0U;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered error callback*/
  hlpuart->ErrorCallback(hlpuart);
#else
  /*Call legacy weak error callback*/
  HAL_LPUART_ErrorCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA LPUART Tx communication abort callback, when initiated by user
  *         (To be called at end of DMA Tx Abort procedure following user abort request).
  * @note   When this callback is executed, User Abort complete call back is called only if no
  *         Abort still ongoing for Rx DMA Handle.
  * @param  hdma DMA handle.
  * @retval None
  */
static void LPUART_DMATxAbortCallback(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

  hlpuart->hdmatx->XferAbortCallback = NULL;

  /* Check if an Abort process is still ongoing */
  if (hlpuart->hdmarx != NULL)
  {
    if (hlpuart->hdmarx->XferAbortCallback != NULL)
    {
      return;
    }
  }

  /* No Abort process still ongoing : All DMA channels are aborted, call user Abort Complete callback */
  hlpuart->TxXferCount = 0U;
  hlpuart->RxXferCount = 0U;

